; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport two-cities-sequential-3nodes-1000size-3degree-100mindistance-2trucks-3packages-44seed

(define (problem transport-two-cities-sequential-3nodes-1000size-3degree-100mindistance-2trucks-3packages-44seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  truck-1 - vehicle
  truck-2 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 554,718 -> 418,532
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 23)
  ; 418,532 -> 554,718
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 23)
  ; 882,119 -> 418,532
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 63)
  ; 418,532 -> 882,119
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 63)
  ; 2230,296 -> 2180,388
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 11)
  ; 2180,388 -> 2230,296
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 11)
  ; 2029,230 -> 2180,388
  (road city-2-loc-3 city-2-loc-1)
  (= (road-length city-2-loc-3 city-2-loc-1) 22)
  ; 2180,388 -> 2029,230
  (road city-2-loc-1 city-2-loc-3)
  (= (road-length city-2-loc-1 city-2-loc-3) 22)
  ; 2029,230 -> 2230,296
  (road city-2-loc-3 city-2-loc-2)
  (= (road-length city-2-loc-3 city-2-loc-2) 22)
  ; 2230,296 -> 2029,230
  (road city-2-loc-2 city-2-loc-3)
  (= (road-length city-2-loc-2 city-2-loc-3) 22)
  ; 882,119 <-> 2029,230
  (road city-1-loc-3 city-2-loc-3)
  (= (road-length city-1-loc-3 city-2-loc-3) 116)
  (road city-2-loc-3 city-1-loc-3)
  (= (road-length city-2-loc-3 city-1-loc-3) 116)
  (at package-1 city-1-loc-1)
  (at package-2 city-1-loc-3)
  (at package-3 city-1-loc-1)
  (at truck-1 city-2-loc-1)
  (capacity truck-1 capacity-2)
  (at truck-2 city-2-loc-3)
  (capacity truck-2 capacity-4)
 )
 (:goal (and
  (at package-1 city-2-loc-2)
  (at package-2 city-2-loc-3)
  (at package-3 city-2-loc-3)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-2 city-2-loc-3 city-1-loc-3)
   deleted: (at truck-2 city-2-loc-3)
   added: (at truck-2 city-1-loc-3)
   goals met: 0 of 3
2. (pick-up truck-2 city-1-loc-3 package-2 capacity-3 capacity-4)
   deleted: (at package-2 city-1-loc-3) (capacity truck-2 capacity-4)
   added: (in package-2 truck-2) (capacity truck-2 capacity-3)
   goals met: 0 of 3
3. (drive truck-2 city-1-loc-3 city-1-loc-1)
   deleted: (at truck-2 city-1-loc-3)
   added: (at truck-2 city-1-loc-1)
   goals met: 0 of 3
4. (pick-up truck-2 city-1-loc-1 package-3 capacity-2 capacity-3)
   deleted: (at package-3 city-1-loc-1) (capacity truck-2 capacity-3)
   added: (in package-3 truck-2) (capacity truck-2 capacity-2)
   goals met: 0 of 3
5. (pick-up truck-2 city-1-loc-1 package-1 capacity-1 capacity-2)
   deleted: (at package-1 city-1-loc-1) (capacity truck-2 capacity-2)
   added: (in package-1 truck-2) (capacity truck-2 capacity-1)
   goals met: 0 of 3
6. (drive truck-2 city-1-loc-1 city-1-loc-3)
   deleted: (at truck-2 city-1-loc-1)
   added: (at truck-2 city-1-loc-3)
   goals met: 0 of 3
7. (drive truck-2 city-1-loc-3 city-2-loc-3)
   deleted: (at truck-2 city-1-loc-3)
   added: (at truck-2 city-2-loc-3)
   goals met: 0 of 3
8. (drop truck-2 city-2-loc-3 package-2 capacity-1 capacity-2)
   deleted: (in package-2 truck-2) (capacity truck-2 capacity-1)
   added: (at package-2 city-2-loc-3) (capacity truck-2 capacity-2)
   goals met: 1 of 3
9. (drop truck-2 city-2-loc-3 package-3 capacity-2 capacity-3)
   deleted: (in package-3 truck-2) (capacity truck-2 capacity-2)
   added: (at package-3 city-2-loc-3) (capacity truck-2 capacity-3)
   goals met: 2 of 3
10. (drive truck-2 city-2-loc-3 city-2-loc-2)
   deleted: (at truck-2 city-2-loc-3)
   added: (at truck-2 city-2-loc-2)
   goals met: 2 of 3
11. (drop truck-2 city-2-loc-2 package-1 capacity-3 capacity-4)
   deleted: (in package-1 truck-2) (capacity truck-2 capacity-3)
   added: (at package-1 city-2-loc-2) (capacity truck-2 capacity-4)
   goals met: 3 of 3
